[
    {
        "subtask_id": "subtask_1",
        "objective": "Calculate the radius of the torus and its revolution distance based on the given parameters.",
        "supporting_info": "The torus is defined by a circle with radius 3 and revolves around an axis 6 units away from its center.",
        "agent_collaboration": "CoT",
        "dependencies": [],
        "subtask_name": "Calculate Derived Quantities",
        "abstracted_objective": "Calculate derived quantities based on given parameters and initial conditions."
    },
    {
        "subtask_id": "subtask_2",
        "objective": "Determine the conditions for tangency between the torus and the sphere based on the output of sub-task 1.",
        "supporting_info": "The sphere has a radius of 11, and the conditions for tangency depend on the calculated radius of the torus.",
        "agent_collaboration": "SC_CoT",
        "dependencies": [
            "subtask_1"
        ],
        "subtask_name": "Determine Conditions for Interaction",
        "abstracted_objective": "Determine the conditions for interaction between components based on previously calculated quantities."
    },
    {
        "subtask_id": "subtask_3",
        "objective": "Calculate the difference between the radii of the circles of tangency based on the output of sub-task 2.",
        "supporting_info": "The output from sub-task 2 provides the necessary conditions to compute the radii of the circles of tangency.",
        "agent_collaboration": "Reflexion",
        "dependencies": [
            "subtask_2"
        ],
        "subtask_name": "Calculate Difference Between Quantities",
        "abstracted_objective": "Calculate the difference between two related quantities based on previously determined conditions."
    },
    {
        "subtask_id": "subtask_4",
        "objective": "Simplify the expression for the difference and find the sum of the numerator and denominator when expressed as a fraction in simplest form.",
        "supporting_info": "The output from sub-task 3 gives the difference in radii, which needs to be simplified to find the final answer.",
        "agent_collaboration": "Debate",
        "dependencies": [
            "subtask_3"
        ],
        "subtask_name": "Simplify and Sum Components",
        "abstracted_objective": "Simplify the expression for a calculated difference and find the sum of its components when expressed in simplest form."
    }
]