[
    {
        "subtask_id": "subtask_1",
        "objective": "Identify all possible combinations of digits for the top row that form a three-digit number.",
        "supporting_info": "The top row must consist of three digits, each ranging from 0 to 9, and must form a valid three-digit number.",
        "agent_collaboration": "CoT",
        "dependencies": [],
        "subtask_name": "Identify possible combinations",
        "abstracted_objective": "Identify all possible combinations of elements for a given set that meet specific criteria."
    },
    {
        "subtask_id": "subtask_2",
        "objective": "Identify all possible combinations of digits for the bottom row that form a three-digit number.",
        "supporting_info": "The bottom row must consist of three digits, each ranging from 0 to 9, and must form a valid three-digit number.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_1"
        ],
        "subtask_name": "Identify possible combinations",
        "abstracted_objective": "Identify all possible combinations of elements for another set that meet specific criteria."
    },
    {
        "subtask_id": "subtask_3",
        "objective": "Find combinations where the sum of the two numbers formed by reading left to right is 999.",
        "supporting_info": "This requires the outputs from subtask 1 and subtask 2 to check the left-to-right sums.",
        "agent_collaboration": "SC_CoT",
        "dependencies": [
            "subtask_1",
            "subtask_2"
        ],
        "subtask_name": "Evaluate sum condition",
        "abstracted_objective": "Evaluate combinations to find those that satisfy a specific sum condition for one configuration."
    },
    {
        "subtask_id": "subtask_4",
        "objective": "Find combinations where the sum of the three numbers formed by reading top to bottom is 99.",
        "supporting_info": "This requires the outputs from subtask 1 and subtask 2 to check the top-to-bottom sums.",
        "agent_collaboration": "SC_CoT",
        "dependencies": [
            "subtask_1",
            "subtask_2"
        ],
        "subtask_name": "Evaluate sum condition",
        "abstracted_objective": "Evaluate combinations to find those that satisfy a specific sum condition for another configuration."
    },
    {
        "subtask_id": "subtask_5",
        "objective": "Identify the common combinations that satisfy both the left-to-right and top-to-bottom sum conditions.",
        "supporting_info": "This requires the outputs from subtask 3 and subtask 4 to find overlapping valid combinations.",
        "agent_collaboration": "Debate",
        "dependencies": [
            "subtask_3",
            "subtask_4"
        ],
        "subtask_name": "Identify common solutions",
        "abstracted_objective": "Identify the common solutions that satisfy multiple conditions from different evaluations."
    }
]