[
    {
        "subtask_id": "subtask_1",
        "objective": "Calculate the radius of the torus and its revolution distance based on the given parameters.",
        "supporting_info": "A torus is defined by a circle of radius 3 revolving around an axis 6 units away, affecting its overall geometry.",
        "agent_collaboration": "CoT",
        "dependencies": []
    },
    {
        "subtask_id": "subtask_2",
        "objective": "Determine the conditions for tangency between the torus and the sphere based on the previous calculations.",
        "supporting_info": "The output of subtask 1 provides essential dimensions necessary to analyze the tangency conditions with the sphere of radius 11.",
        "agent_collaboration": "SC_CoT",
        "dependencies": [
            "subtask_1"
        ]
    },
    {
        "subtask_id": "subtask_3.1",
        "objective": "Calculate the radius of the circle of tangency for external tangency using the Pythagorean theorem.",
        "supporting_info": "Utilizes the conditions determined in subtask 2 to derive the external tangency radius of the torus and sphere.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_2"
        ]
    },
    {
        "subtask_id": "subtask_3.2",
        "objective": "Calculate the radius of the circle of tangency for internal tangency using the Pythagorean theorem.",
        "supporting_info": "Similar to subtask 3.1 but focuses on the internal tangency scenario of the torus and sphere.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_2"
        ]
    },
    {
        "subtask_id": "subtask_3.3",
        "objective": "Calculate the difference between the external and internal tangency radii.",
        "supporting_info": "Requires results from subtask 3.1 and subtask 3.2 to derive the final radius difference needed for the final expression.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_3.1",
            "subtask_3.2"
        ]
    },
    {
        "subtask_id": "subtask_4",
        "objective": "Simplify the expression for the radius difference and find the sum of the numerator and denominator in simplest form.",
        "supporting_info": "Based on the calculated difference from subtask 3.3, further mathematical simplification and formatting are required.",
        "agent_collaboration": "Debate",
        "dependencies": [
            "subtask_3.3"
        ]
    }
]