[
    {
        "subtask_id": "subtask_1",
        "objective": "Calculate the radius of the torus and its revolution distance based on the given parameters.",
        "supporting_info": "The torus is generated from revolving a circle with radius 3 around an axis a distance 6 from the center.",
        "agent_collaboration": "CoT",
        "dependencies": []
    },
    {
        "subtask_id": "subtask_2",
        "objective": "Determine the conditions for tangency between the torus and the sphere based on the output of sub-task 1.",
        "supporting_info": "The radius of the sphere is 11 and affects the conditions under which the torus is tangent to it.",
        "agent_collaboration": "SC_CoT",
        "dependencies": [
            "subtask_1"
        ]
    },
    {
        "subtask_id": "subtask_3.1",
        "objective": "Calculate the radius of the circle of tangency for external tangency using the Pythagorean theorem.",
        "supporting_info": "The given conditions for tangency from sub-task 2 will inform the calculations here.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_2"
        ]
    },
    {
        "subtask_id": "subtask_3.2",
        "objective": "Calculate the radius of the circle of tangency for internal tangency using the Pythagorean theorem.",
        "supporting_info": "This calculation will also rely on the tangency conditions established in sub-task 2.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_2"
        ]
    },
    {
        "subtask_id": "subtask_3.3.2.1",
        "objective": "Re-evaluate the geometric setup and verify the conditions for external and internal tangency.",
        "supporting_info": "Verification is crucial to ensure correctness of the tangency conditions derived earlier.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_3.1",
            "subtask_3.2"
        ]
    },
    {
        "subtask_id": "subtask_3.3.2.2",
        "objective": "Calculate the exact difference based on verified conditions.",
        "supporting_info": "This step uses the results from the verification stage to finalize the numerical values of the radii.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_3.3.2.1"
        ]
    },
    {
        "subtask_id": "subtask_4",
        "objective": "Simplify the expression for the difference and find the sum of the numerator and denominator when expressed as a fraction in simplest form.",
        "supporting_info": "Final simplification will help determine the resultant values that need to be provided in simplest terms.",
        "agent_collaboration": "Debate",
        "dependencies": [
            "subtask_3.3.2.2"
        ]
    }
]