[
    {
        "subtask_id": "subtask_1",
        "objective": "To determine the equations of the diagonals of the rhombus defined by points A, B, C, and D, which intersects at the origin and is aligned with the hyperbola's axes.",
        "supporting_info": "The rhombus is symmetrical about both the x-axis and y-axis due to the arrangement of points coinciding with the hyperbola. This requires an understanding of how diagonals behave in coordinate geometry.",
        "agent_collaboration": "CoT",
        "dependencies": []
    },
    {
        "subtask_id": "subtask_2",
        "objective": "To determine the specific lengths of the diagonals based on the equations derived in the first subtask and their intersection points with the hyperbola.",
        "supporting_info": "The lengths of the diagonals are critical for subsequently finding the coordinates of the rhombus' vertices, and must reflect the geometry of the hyperbola.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_1"
        ]
    },
    {
        "subtask_id": "subtask_3",
        "objective": "To calculate the coordinates of points A, B, C, and D using the specific lengths of the diagonals from subtask 2 and the hyperbola's equation.",
        "supporting_info": "Exact coordinates of the points depend on the precise lengths from the previous subtask and the structure of the hyperbola, necessitating multiple evaluations for accuracy.",
        "agent_collaboration": "SC_CoT",
        "dependencies": [
            "subtask_2"
        ]
    },
    {
        "subtask_id": "subtask_4",
        "objective": "To analyze the symmetry properties of the hyperbola and assess how these properties affect the configuration of the rhombus formed by points A, B, C, and D.",
        "supporting_info": "Understanding the hyperbola's symmetry will provide insights into the spatial relationships and properties of the rhombus.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_3"
        ]
    },
    {
        "subtask_id": "subtask_5",
        "objective": "To evaluate the impact of rotating the rhombus around the origin and how this rotation affects the calculation of BD^2.",
        "supporting_info": "The evaluation of rotation involves understanding how the geometry of the rhombus transforms and impacts distance calculations, particularly concerning BD.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_4"
        ]
    },
    {
        "subtask_id": "subtask_6",
        "objective": "To compute the maximum value of BD^2 through careful reflection on previous outputs and applying critical feedback to ensure accuracy.",
        "supporting_info": "This task requires iterative improvement based on prior results, necessitating a close evaluation of possible mistakes and leveraging insights for enhanced accuracy.",
        "agent_collaboration": "Reflexion",
        "dependencies": [
            "subtask_5"
        ]
    }
]