[
    {
        "subtask_id": "subtask_1",
        "objective": "Calculate the radius of the torus and its revolution distance based on the given parameters.",
        "supporting_info": "The torus is defined by a circle of radius 3 revolving around an axis at distance 6 from its center, establishing its dimensions.",
        "agent_collaboration": "CoT",
        "dependencies": []
    },
    {
        "subtask_id": "subtask_2",
        "objective": "Determine the conditions for tangency between the torus and the sphere based on the output of sub-task 1.",
        "supporting_info": "The tangency conditions depend on the geometric relationship between the torus (parameters calculated in sub-task 1) and the sphere of radius 11.",
        "agent_collaboration": "SC_CoT",
        "dependencies": [
            "subtask_1"
        ]
    },
    {
        "subtask_id": "subtask_3.1",
        "objective": "Calculate the radius of the circle of tangency for external tangency using the Pythagorean theorem.",
        "supporting_info": "This relies on the tangency conditions established in sub-task 2 to derive the radius of the external circle of tangency.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_2"
        ]
    },
    {
        "subtask_id": "subtask_3.2",
        "objective": "Calculate the radius of the circle of tangency for internal tangency using the Pythagorean theorem.",
        "supporting_info": "Similar to sub-task 3.1, but it focuses on the internal tangency conditions identified in sub-task 2.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_2"
        ]
    },
    {
        "subtask_id": "subtask_3.3.1",
        "objective": "Verify the calculated radii for external and internal tangency to ensure they align with the geometric problem setup.",
        "supporting_info": "Verification is crucial to confirm that the previously calculated radii match the geometric relationships within the problem.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_3.1",
            "subtask_3.2"
        ]
    },
    {
        "subtask_id": "subtask_3.3.2",
        "objective": "Calculate the difference between the external and internal radii.",
        "supporting_info": "This requires the verified radii from sub-task 3.3.1 to compute the difference accurately.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_3.3.1"
        ]
    },
    {
        "subtask_id": "subtask_4",
        "objective": "Simplify the expression for the difference and find the sum of the numerator and denominator when expressed as a fraction in simplest form.",
        "supporting_info": "This uses the difference calculated in sub-task 3.3.2 to express the result as a simplified fraction.",
        "agent_collaboration": "Debate",
        "dependencies": [
            "subtask_3.3.2"
        ]
    }
]