[
    {
        "name": "abstract_workflow_1",
        "flow": {
            "Stage 1": {
                "Title": "Condition Identification and Decomposition",
                "Content": "Identify and decompose the required conditions from the task to enable structured reasoning. This involves breaking the problem into smaller subtasks that target specific conditions essential for solving the query.",
                "Objectives": [
                    "Identify all necessary conditions required to solve the query",
                    "Decompose conditions into sequential and logical subtasks",
                    "Ensure each subtask focuses on a distinct reasoning component"
                ],
                "ExampleSubtasks": [
                    "Sub-task 1: Calculate [condition #1], with context of .......",
                    "Sub-task 2: Based on the output from Sub-task 1, calculate [condition #2], with context ....."
                ]
            },
            "Stage 2": {
                "Title": "Inference and Synthesis",
                "Content": "Use the outputs from Stage 1 to synthesize a final answer. This stage infers the solution by integrating intermediate results and drawing conclusions through iterative refinement.",
                "Objectives": [
                    "Use insights from Stage 1 to infer the final answer",
                    "Synthesize intermediate steps into a cohesive conclusion",
                    "Iteratively refine the final output through multi-round reasoning"
                ],
                "ExampleSubtasks": [
                    "Sub-task 3: Based on the outputs from Sub-task 1 and Sub-task 2, calculate the [final answer]"
                ]
            }
        },
        "code_path": "abstract_workflow/abstract_workflow_1.py"
    },
    {
        "name": "abstract_workflow_2",
        "flow": {
            "Stage 1": {
                "Title": "Condition Identification and Modular Reasoning",
                "Content": "This stage focuses on identifying and computing the necessary preconditions or foundational elements required before attempting to derive any intermediate or final result. The subtasks are modularized to isolate different conditions.",
                "Objectives": [
                    "Identify distinct and necessary conditions before computing the final output.",
                    "Break down the problem into modular, condition-specific subtasks.",
                    "Ensure each condition is computed independently for clarity and reuse."
                ],
                "ExampleSubtasks": [
                    "Sub-task 1: Calculate [condition #1], with context ....",
                    "Sub-task 2: Based on the output from Sub-task 1, calculate [condition #2], with context ....."
                ]
            },
            "Stage 2": {
                "Title": "Intermediate Inference and Validation",
                "Content": "This stage synthesizes the previously computed conditions to produce an intermediate output, which is iteratively refined and validated to ensure correctness before final transformation.",
                "Objectives": [
                    "Compute intermediate output using results from condition subtasks.",
                    "Iteratively validate and refine intermediate reasoning.",
                    "Prepare validated intermediate output for final answer generation."
                ],
                "ExampleSubtasks": [
                    "Sub-task 3: Based on the outputs from Sub-task 1 and Sub-task 2, calculate the [intermediate output]"
                ]
            },
            "Stage 3": {
                "Title": "Final Output Generation and Integration",
                "Content": "This final stage transforms the validated intermediate output into the required output format and computes the final result through integration and transformation steps.",
                "Objectives": [
                    "Transform intermediate result into the target format.",
                    "Compute the final result using structured transformation logic.",
                    "Ensure final answer is derived from validated and integrated outputs."
                ],
                "ExampleSubtasks": [
                    "Sub-task 4: Based on the output of sub-task 3, convert [intermediate output] into [specific format] and calculate [the final answer]"
                ]
            }
        },
        "code_path": "abstract_workflow/abstract_workflow_2.py"
    },
    {
        "name": "abstract_workflow_3",
        "flow": {
            "Stage 1": {
                "Title": "Scenario Exploration and Enumeration",
                "Content": "Comprehensively consider or evaluate all possible scenarios of the problems referred to in the queries. Each problem may require a dedicated step for consideration[1].",
                "Objectives": [
                    "Comprehensively consider or evaluate all possible scenarios of the problems referred to in the queries[1].",
                    "Each problem in the queries, if necessary, requires a dedicated step for consideration[1]."
                ],
                "ExampleSubtasks": [
                    "Consider / calculate all possible cases for [problem #1][1].",
                    "Based on the output from the first sub-task, consider / calculate potential cases of [problem #2][1]."
                ]
            },
            "Stage 2": {
                "Title": "Case Aggregation and Filtering",
                "Content": "Aggregate and filter the cases generated in Stage 1 to retain only those that meet the conditions stated in the queries[1].",
                "Objectives": [
                    "Aggregate and filter the cases that meet the conditions stated in the queries[1].",
                    "Validate and retain only relevant, condition-satisfying cases[1]."
                ],
                "ExampleSubtasks": [
                    "Based on the outputs from Sub-task 1 and sub-task 2, filter the valid scenarios that meet the [conditions stated in the queries][1]."
                ]
            },
            "Stage 3": {
                "Title": "Intermediate Output Calculation",
                "Content": "Calculate an intermediate output based on the filtered valid cases from Stage 2[1].",
                "Objectives": [
                    "Calculate the intermediate output based on the filtered valid cases from [Stage 2][1].",
                    "Derive a more powerful and comprehensive intermediate output[1]."
                ],
                "ExampleSubtasks": [
                    "Based on the outputs from Sub-task 1, sub-task 2 and sub-task 3, calculate the [intermediate output][1]."
                ]
            },
            "Stage 4": {
                "Title": "Final Answer Derivation",
                "Content": "Convert the intermediate output from Stage 3 into the required format and use it to calculate the final answer for the corresponding query[1].",
                "Objectives": [
                    "Convert the intermediate output to the required format[1].",
                    "Use the converted output to calculate the final answer for the corresponding query[1].",
                    "Ensure a comprehensive and well-supported final answer[1]."
                ],
                "ExampleSubtasks": [
                    "Based on the output of sub-task 3, convert [intermediate answer] into [specific format] and calculate [the final answer][1]."
                ]
            }
        },
        "code_path": "abstract_workflow/abstract_workflow_3.py"
    },
    {
        "name": "abstract_workflow_4",
        "flow": {
            "Stage 1": {
                "Title": "Parametric Representation Identification",
                "Content": "This stage focuses on identifying the parametric representation of the quantities in the queries. Each quantity is addressed in a dedicated step to ensure clarity and modularity[1].",
                "Objectives": [
                    "Identify the parametric representation of the quantities in the queries[1].",
                    "Ensure each quantity is addressed through a dedicated step for clarity and modularity[1]."
                ],
                "ExampleSubtasks": [
                    "Identify parametric representation of [quantity #1][1].",
                    "Identify the parametric representation of [quantity #2][1]."
                ]
            },
            "Stage 2": {
                "Title": "Expression Analysis and Transformation",
                "Content": "Based on the expressions identified in Stage 1, this stage analyzes and transforms them into a form that better fits the query's specific conditions and requirements[1].",
                "Objectives": [
                    "Analyze and transform the identified expressions to obtain a form that better fits the query's conditions[1]."
                ],
                "ExampleSubtasks": [
                    "Transform the [expression #1] into a clearer form that better fits [condition #1][1]."
                ]
            },
            "Stage 3": {
                "Title": "Final Output Calculation",
                "Content": "Using the transformed expressions from Stage 2, this stage calculates the final output that corresponds to the query's requirements[1].",
                "Objectives": [
                    "Calculate the final output corresponding to the query's requirements[1]."
                ],
                "ExampleSubtasks": [
                    "Calculate the [final output] based on the output of sub-tasks 1, 2, and 3[1]."
                ]
            }
        },
        "code_path": "abstract_workflow/abstract_workflow_4.py"
    },
    {
        "name": "abstract_workflow_5",
        "flow": {
            "Stage 1": {
                "Title": "Problem Decomposition and Information Extraction",
                "Content": "This stage identifies necessary information, inferences, equations, theories, properties, or constraints from the queries and their relationships. It ensures that each necessary element is mapped to a distinct sub-task to support structured reasoning[1].",
                "Objectives": [
                    "Identify necessary information, inferences, equations, theories, properties, or constraints from the queries and their relationships[1].",
                    "Ensure each necessary element maps to a distinct sub-task to support structured reasoning[1]."
                ],
                "ExampleSubtasks": [
                    "Sub-task 1: Identify the first set of information, constraints, or equations[1].",
                    "Sub-task 2: Identify additional information, building upon the results of Sub-task 1[1]."
                ]
            },
            "Stage 2": {
                "Title": "Intermediate Value Analysis and Transformation",
                "Content": "This stage analyzes and transforms the identified information from the previous stage to calculate intermediate values. It ensures each intermediate value aligns with a distinct sub-task for clear, modular computation[1].",
                "Objectives": [
                    "Analyze and transform the identified information to calculate intermediate values[1].",
                    "Ensure each intermediate value aligns with a distinct sub-task for clear, modular computation[1]."
                ],
                "ExampleSubtasks": [
                    "Sub-task 3: Calculate an intermediate value based on the outputs from Sub-task 1 and Sub-task 2[1]."
                ]
            },
            "Stage 3": {
                "Title": "Final Output Computation",
                "Content": "This stage calculates the final output for the query, grounded in the prior analysis and intermediate values. The goal is to produce a result that is accurate, comprehensive, and aligned with the query's requirements[1].",
                "Objectives": [
                    "Calculate the final output corresponding to the query or request, grounded in prior analysis and intermediate values[1].",
                    "Ensure the final result is accurate, comprehensive, and aligned with the query's requirements[1]."
                ],
                "ExampleSubtasks": [
                    "Sub-task 4: Calculate the final output based on the results of sub-tasks 1, 2, and 3[1]."
                ]
            },
            "Stage 4": {
                "Title": "Final Answer Derivation and Formatting",
                "Content": "This final stage converts the output from the previous sub-task into the required format and uses this formatted result to calculate the final answer for the query[1].",
                "Objectives": [
                    "Convert the final output from the previous subtask into the required format[1].",
                    "Use the formatted result to calculate the final answer for the corresponding query[1]."
                ],
                "ExampleSubtasks": [
                    "Sub-task 5: Convert the final output into a specific format and calculate the final answer based on the output of sub-task 4[1]."
                ]
            }
        },
        "code_path": "abstract_workflow/abstract_workflow_5.py"
    },
    {
        "name": "abstract_workflow_6",
        "flow": {
            "Stage 1": {
                "Title": "Condition Identification and Subtask Structuring",
                "Content": "This stage focuses on identifying the necessary conditions required to compute the final output. It breaks down these conditions into distinct sub-tasks to create a modular and logical workflow.",
                "Objectives": [
                    "Identify the necessary conditions required before computing the final output.",
                    "Ensure each condition is mapped to a distinct sub-task for modular and logical progression."
                ],
                "ExampleSubtasks": [
                    "Calculate condition #1",
                    "Calculate condition #2"
                ]
            },
            "Stage 2": {
                "Title": "Intermediate Inference and Calculation",
                "Content": "This stage involves inferring relevant statements and performing intermediate calculations. It builds upon the conditions identified in the first stage to move closer to the final solution.",
                "Objectives": [
                    "Infer relevant statements and perform intermediate calculations based on the previously identified conditions.",
                    "Ensure each inference contributes meaningfully to solving the overall query."
                ],
                "ExampleSubtasks": [
                    "Infer [statement / calculation #1]",
                    "Infer [statement / calculation #2]"
                ]
            },
            "Stage 3": {
                "Title": "Intermediate Answer Calculation",
                "Content": "This stage integrates the outputs from all previous steps to calculate an intermediate answer. It ensures that the result is consistent with the logical flow and constraints established earlier.",
                "Objectives": [
                    "Calculate the intermediate answer for the query by integrating outputs from all previous steps.",
                    "Ensure the result aligns with the logical flow and constraints identified earlier."
                ],
                "ExampleSubtasks": [
                    "Calculate an [intermediate answer]"
                ]
            },
            "Stage 4": {
                "Title": "Final Answer Derivation",
                "Content": "This final stage calculates the definitive answer to the query. It integrates all intermediate steps and logical inferences from the preceding stages to ensure the solution is complete and satisfies all requirements.",
                "Objectives": [
                    "Calculate the final answer for the query by integrating all intermediate steps and logical inferences from earlier stages.",
                    "Ensure the solution fully satisfies the query’s requirements and constraints."
                ],
                "ExampleSubtasks": [
                    "Calculate the [final answer]"
                ]
            }
        },
        "code_path": "abstract_workflow/abstract_workflow_6.py"
    }
]