[
    {
        "subtask_id": "subtask_1",
        "objective": "Determine the equations of the diagonals of the rhombus given that they intersect at the origin and are aligned with the axes of the hyperbola.",
        "supporting_info": "The diagonals of the rhombus, by definition, must intersect at the origin, allowing for the alignment of each diagonal along the axes of the hyperbola's equation.",
        "agent_collaboration": "CoT",
        "dependencies": [],
        "subtask_name": "Identify foundational relationships",
        "abstracted_objective": "Identify essential geometric or algebraic relationships that form the basis for further calculations in a defined space."
    },
    {
        "subtask_id": "subtask_2",
        "objective": "Based on the output from subtask 1, determine the specific lengths of the diagonals of the rhombus based on the intersection with the hyperbola.",
        "supporting_info": "The lengths of the diagonals are essential for defining the vertices of the rhombus, which must satisfy the hyperbola's equations.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_1"
        ],
        "subtask_name": "Quantify essential dimensions",
        "abstracted_objective": "Quantify key dimensional attributes or parameters that are necessary for defining the object or system being analyzed."
    },
    {
        "subtask_id": "subtask_3",
        "objective": "Based on the output from subtask 2, calculate the exact coordinates of points A, B, C, and D using the specific diagonal lengths and the hyperbola equation.",
        "supporting_info": "Finding the vertices of the rhombus requires detailed calculations based on the previously determined diagonal lengths and their relationship with the hyperbola.",
        "agent_collaboration": "SC_CoT",
        "dependencies": [
            "subtask_2"
        ],
        "subtask_name": "Calculate specific coordinates or points",
        "abstracted_objective": "Derive specific entities or points within the established framework based on previously determined attributes and relationships."
    },
    {
        "subtask_id": "subtask_4",
        "objective": "Compute BD^2 and determine the greatest real number less than BD^2.",
        "supporting_info": "To find the greatest real number less than BD^2, we must carefully evaluate previous attempts and ensure mathematical accuracy based on the coordinates calculated in subtask 3.",
        "agent_collaboration": "Reflexion | Debate",
        "dependencies": [
            "subtask_3"
        ],
        "subtask_name": "Evaluate derived metrics",
        "abstracted_objective": "Evaluate and analyze derived metrics or outcomes, integrating prior calculations to ascertain maximum or optimal values within a defined context."
    }
]