[
    {
        "subtask_id": "subtask_1",
        "objective": "Determine the equations of the diagonals of the rhombus that intersect at the origin and are aligned with the axes of the hyperbola.",
        "supporting_info": "The rhombus has its diagonals aligned with the axes, and they intersect at the origin, which serves as a symmetry point for the points A, B, C, and D.",
        "agent_collaboration": "CoT",
        "dependencies": [],
        "subtask_name": "Determine Orientation and Symmetry",
        "abstracted_objective": "Identify key geometric or structural relationships that define the configuration of an object or system, taking into account their symmetries and orientations."
    },
    {
        "subtask_id": "subtask_2",
        "objective": "Calculate the coordinates of points A, B, C, and D using the equations of the diagonals and the condition that these points lie on the hyperbola.",
        "supporting_info": "The output from subtask 1 provides the necessary equations required to solve for the points on the hyperbola given the constraints of the rhombus.",
        "agent_collaboration": "SC_CoT",
        "dependencies": [
            "subtask_1"
        ],
        "subtask_name": "Extract Key Instances",
        "abstracted_objective": "Generate specific instances or values that comply with defined conditions and relationships established in preceding analysis."
    },
    {
        "subtask_id": "subtask_3",
        "objective": "Compute BD^2 and determine the greatest real number less than BD^2 for all such rhombi.",
        "supporting_info": "This subtask builds upon the coordinates derived in subtask 2 and aims to solve the query mathematically by calculating the square of the diagonal BD and analyzing results iteratively through reflection and critique.",
        "agent_collaboration": "Reflexion",
        "dependencies": [
            "subtask_2"
        ],
        "subtask_name": "Analyze Quantitative Relationships",
        "abstracted_objective": "Evaluate quantitative relationships derived from previous instances to infer specific properties or maximums within the system being studied."
    }
]