[
    {
        "subtask_id": "subtask_1",
        "objective": "Determine the equations of the diagonals of the rhombus, which must intersect at the origin and align with the axes of the hyperbola.",
        "supporting_info": "The problem states that the diagonals of the rhombus intersect at the origin, which allows for placing the shape in a coordinate system where its symmetry can be exploited. The alignment with the axes of the hyperbola is a key consideration in defining the equations.",
        "agent_collaboration": "CoT",
        "dependencies": [],
        "subtask_name": "Define Geometric Relationships",
        "abstracted_objective": "Establish foundational geometric relationships and constraints within a specified coordinate system to facilitate further computations."
    },
    {
        "subtask_id": "subtask_2",
        "objective": "Determine the specific lengths of the diagonals of the rhombus based on their equations and their intersection points with the hyperbola.",
        "supporting_info": "The output from subtask 1 provides the necessary mathematical groundwork to derive the lengths of the rhombus's diagonals, which are crucial for subsequently locating the vertices A, B, C, and D.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_1"
        ],
        "subtask_name": "Calculate Derived Geometric Measurements",
        "abstracted_objective": "Calculate necessary measurements that derive from previously established relationships, essential for progressing to the next stage of analysis."
    },
    {
        "subtask_id": "subtask_3",
        "objective": "Calculate the exact coordinates of points A, B, C, and D, using the specific diagonal lengths derived from the hyperbola's equation.",
        "supporting_info": "Using the lengths of the diagonals and their properties, this step involves finding the intersection points of the diagonals with the hyperbola, ensuring A, B, C, and D lie on it while forming a rhombus.",
        "agent_collaboration": "SC_CoT",
        "dependencies": [
            "subtask_2"
        ],
        "subtask_name": "Identify Spatial Coordinates",
        "abstracted_objective": "Derive spatial coordinates of significant points utilizing established measurements and properties derived from previous steps."
    },
    {
        "subtask_id": "subtask_4",
        "objective": "Compute BD^2 and determine the greatest real number that is less than BD^2, considering all calculated coordinates.",
        "supporting_info": "This step synthesizes the information from previous subtasks to calculate the square of the length of diagonal BD and explores configurations to refine this result to answer the original query.",
        "agent_collaboration": "Debate",
        "dependencies": [
            "subtask_3"
        ],
        "subtask_name": "Evaluate Geometric Properties",
        "abstracted_objective": "Analyze and evaluate properties derived from spatial coordinates and measurements to refine results and respond to overarching inquiries."
    }
]