[
    {
        "subtask_id": "subtask_1",
        "objective": "Identify all possible combinations of digits for the top row that form a three-digit number.",
        "supporting_info": "The top row must be a valid three-digit number under the given constraints of the overall problem.",
        "agent_collaboration": "CoT",
        "dependencies": [],
        "subtask_name": "Generate Combinations",
        "abstracted_objective": "Determine valid configurations of elements constrained by specific conditions."
    },
    {
        "subtask_id": "subtask_2",
        "objective": "Identify all possible combinations of digits for the bottom row that form a three-digit number.",
        "supporting_info": "Similar to the top row, the bottom row must also be a valid three-digit number while adhering to the problem constraints.",
        "agent_collaboration": "CoT",
        "dependencies": [
            "subtask_1"
        ],
        "subtask_name": "Generate Combinations",
        "abstracted_objective": "Determine valid configurations of elements constrained by specific conditions."
    },
    {
        "subtask_id": "subtask_3",
        "objective": "Find combinations where the sum of the two numbers formed by reading left to right is 999.",
        "supporting_info": "This verification is based on the outputs of subtask 1 (top row combinations) and subtask 2 (bottom row combinations). Only relevant combinations will be considered.",
        "agent_collaboration": "SC_CoT",
        "dependencies": [
            "subtask_1",
            "subtask_2"
        ],
        "subtask_name": "Validate Combinations",
        "abstracted_objective": "Verify the correctness of certain combinations against a defined numerical condition."
    },
    {
        "subtask_id": "subtask_4",
        "objective": "Find combinations where the sum of the three numbers formed by reading top to bottom is 99.",
        "supporting_info": "Like subtask 3, this verification is based on the outputs of the previous subtasks and must adhere to the numeric constraints outlined in the problem.",
        "agent_collaboration": "SC_CoT",
        "dependencies": [
            "subtask_1",
            "subtask_2"
        ],
        "subtask_name": "Validate Combinations",
        "abstracted_objective": "Verify the correctness of certain combinations against a defined numerical condition."
    },
    {
        "subtask_id": "subtask_5",
        "objective": "Identify the common combinations that satisfy both conditions verified in subtasks 3 and 4.",
        "supporting_info": "This subtask looks for overlaps between valid combinations from both previous verifications to meet the overall requirements of the problem.",
        "agent_collaboration": "Debate",
        "dependencies": [
            "subtask_3",
            "subtask_4"
        ],
        "subtask_name": "Intersect Valid Combinations",
        "abstracted_objective": "Determine shared elements that meet multiple validation criteria."
    }
]