{
    "0": "Evaluate a collection of candidate elements against defined criteria or conditions and select the element or subset that best satisfies the specified requirements.",
    "1": "Apply a defined transformation process or mapping to input data or representations to compute or generate corresponding output values or representations.",
    "2": "Evaluate an entity against predefined criteria to determine its compliance, correctness, consistency, and validity, and produce an assessment outcome or feedback.",
    "3": "Generate a structured sequence of intermediate steps by applying a systematic procedure to given inputs, progressively transforming them to produce an initial or provisional output along with any necessary reasoning or documentation.",
    "4": "Compute or determine output values by applying defined operations, relations, or constraints to given input data.",
    "5": "Analyze and characterize the relationships, interactions, or transformations among given inputs to determine their functional associations, dependencies, or resulting outcomes according to specified criteria.",
    "6": "Identify and extract elements from a collection by evaluating each element against specified criteria or conditions and retaining those that satisfy them.",
    "7": "Analyze input entities by evaluating their attributes or features against defined criteria to assign them to appropriate categories or representations, including resolving ambiguities to standardize their classification.",
    "8": "Transform one or more preliminary outputs by simplifying, consolidating, and enhancing them to produce a refined final result that satisfies defined criteria or constraints.",
    "9": "Apply a specified transformation or modification rule to an input entity to produce a modified output entity.",
    "10": "Compute or derive a quantitative or qualitative result by applying specified operations, transformations, or aggregations to given input elements or parameters under defined conditions or constraints.",
    "11": "Combine multiple inputs or intermediate results by applying defined operations or evaluation criteria to produce a single consolidated output.",
    "12": "Analyze an input to identify, extract, and categorize its relevant elements, attributes, criteria, constraints, and relationships to support subsequent processing or reasoning.",
    "13": "Consolidate, transform, and format derived information or computed values into a standardized and coherent final output or summary representation.",
    "14": "Apply a systematic evaluation procedure to assess an item against predefined criteria or standards and produce an indicator reflecting its validity or correctness.",
    "15": "Filter a collection of elements based on specified criteria or conditions and compute the count of elements that satisfy these criteria.",
    "16": "Apply a defined procedure or operation to given inputs to systematically produce transformed outputs or derived results.",
    "17": "Compute a derived quantitative value by applying specified operations or transformations to given input data or parameters.",
    "18": "Generate structured intermediate representations, relationships, or sequences by applying defined operations, constraints, or transformation rules to input elements, thereby bridging initial inputs and desired outputs through systematic stepwise construction."
}